Конфигурация/DataProcessors/ПервоначальноеНаполнение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПервоначальноеНаполнение</Name>
			<Comment>Идемпотентная загрузка эталонных данных (курс, темы, банк заданий, бейджи, библиотека) из JSON-файлов каталога fixtures.</Comment>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация/InformationRegisters/ПараметрыIRT.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыIRT</Name>
			<Comment>Параметры b и a модели IRT для заданий банка по версиям калибровки.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТрудностьB</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДискриминативностьA</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусКалибровки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКалибровкиЗадания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаКалибровки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОтветовВВыборке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТестовыеЗадания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВерсияПараметров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/ОценкиПодготовленностиПоТемам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОценкиПодготовленностиПоТемам</Name>
			<Comment>Срез последних оценок θ обучающихся по темам. Периодический по секунде.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>SE</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/СобытияАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СобытияАналитики</Name>
			<Comment>Лог событий пользователей для построения аналитических отчетов.</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолезнаяНагрузка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытийАналитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСобытия</Name>
					<Comment>Уникальный ключ записи - разводит события с одинаковыми период/пользователь/тема/тип в пределах одной секунды.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/AccumulationRegisters/БаллыОпыта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БаллыОпыта</Name>
			<Comment>Оборотный регистр накопления баллов опыта обучающихся.</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникСсылка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеБаллов</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыдачаБейджа</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзучениеМатериала</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыполнениеПрактическогоЗадания</v8:Type>
						<v8:Type>cfg:DocumentRef.ПопыткаТеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Темы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПричиныНачисленияБаллов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Конфигурация/InformationRegisters/РейтинговыеПозиции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РейтинговыеПозиции</Name>
			<Comment>Снимок рейтинга обучающихся в учебных группах. Периодический по дню.</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ранг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СредняяТета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчебнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Enums/ВидыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыПользователей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Обучающийся</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Преподаватель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Администратор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/СтатусыКалибровкиЗадания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыКалибровкиЗадания</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеКалибровано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИдётКалибровка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Откалибровано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокировано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыМатериаловБиблиотеки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМатериаловБиблиотеки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Учебник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НормативныйДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МетодическоеПособие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Видеоматериал</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ТипыСобытийАналитики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыСобытийАналитики</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОткрытиеМатериала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачалоСессииТеста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтветНаЗадание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗавершениеСессии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеБейджа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачислениеБаллов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Простой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/DataProcessors/ПервоначальноеНаполнение/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Идемпотентно наполняет справочники конфигурации эталонными данными из JSON-файлов.
//
// Параметры:
//  КаталогФикстур - Строка - путь к каталогу fixtures (содержащему courses_seed.json,
//                            badges_seed.json, library_seed.json и подкаталог question_bank).
//
// Возвращаемое значение:
//  Структура:
//   * Курсы     - Число  - количество загруженных курсов.
//   * Темы      - Число  - количество загруженных тем.
//   * Задания   - Число  - количество загруженных заданий.
//   * Бейджи    - Число  - количество загруженных бейджей.
//   * Материалы - Число  - количество загруженных материалов библиотеки.
//   * Ошибка    - Строка - текст ошибки (пустая строка при успехе).
//
// Пример вызова:
//  Результат = Обработки.ПервоначальноеНаполнение.Создать().ВыполнитьНаполнение("C:/repo/Конфигурация/fixtures");
//
Функция ВыполнитьНаполнение(Знач КаталогФикстур = "") Экспорт

    Результат = Новый Структура;
    Результат.Вставить("Курсы",     0);
    Результат.Вставить("Темы",      0);
    Результат.Вставить("Задания",   0);
    Результат.Вставить("Бейджи",    0);
    Результат.Вставить("Материалы", 0);
    Результат.Вставить("Ошибка",    "");

    Попытка
        Каталог = НормализоватьКаталог(КаталогФикстур);

        КартаТем = ЗагрузитьКурсИТемы(Каталог, Результат);
        Если КартаТем = Неопределено Тогда
            КартаТем = Новый Соответствие;
        КонецЕсли;

        ЗагрузитьБанкЗаданий(Каталог, КартаТем, Результат);
        ЗагрузитьБейджи(Каталог, Результат);
        ЗагрузитьБиблиотеку(Каталог, КартаТем, Результат);

        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСобытие(
            "ПервоначальноеНаполнение",
            СтрШаблон(
                "Наполнение завершено. Курсы: %1, темы: %2, задания: %3, бейджи: %4, материалы: %5",
                Результат.Курсы, Результат.Темы, Результат.Задания,
                Результат.Бейджи, Результат.Материалы));

    Исключение
        Результат.Ошибка = ОписаниеОшибки();
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "ПервоначальноеНаполнение", Результат.Ошибка);
    КонецПопытки;

    Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Загружает курс и его темы. Возвращает соответствие «код темы -> ссылка».
//
Функция ЗагрузитьКурсИТемы(Знач Каталог, Результат)

    Данные = ПрочитатьJSONФайл(Каталог + "courses_seed.json");
    Если Данные = Неопределено Тогда
        Возврат Неопределено;
    КонецЕсли;

    КурсДанные = Данные.Получить("курс");
    КодКурса = КурсДанные.Получить("код");
    КурсСсылка = Справочники.Курсы.НайтиПоКоду(КодКурса);
    Если ЗначениеЗаполнено(КурсСсылка) Тогда
        КурсОбъект = КурсСсылка.ПолучитьОбъект();
    Иначе
        КурсОбъект = Справочники.Курсы.СоздатьЭлемент();
        КурсОбъект.Код = КодКурса;
    КонецЕсли;
    КурсОбъект.Наименование     = Усечь(КурсДанные.Получить("наименование"), 150);
    КурсОбъект.ПолноеОписание   = СтрокаИлиПусто(КурсДанные.Получить("полное_описание"));
    КурсОбъект.Преподаватель    = ОбслуживаниеПользователейВызовСервера.НайтиИлиСоздатьПоФИО(
        СтрокаИлиПусто(КурсДанные.Получить("преподаватель")),
        Перечисления.ВидыПользователей.Преподаватель);
    КурсОбъект.ЦелеваяАудитория  = СтрокаИлиПусто(КурсДанные.Получить("целевая_аудитория"));
    КурсОбъект.ДатаНачала       = ДатаИзСтроки(КурсДанные.Получить("дата_начала"));
    КурсОбъект.ДатаОкончания    = ДатаИзСтроки(КурсДанные.Получить("дата_окончания"));
    КурсОбъект.Записать();
    Курс = КурсОбъект.Ссылка;
    Результат.Курсы = Результат.Курсы + 1;

    КартаТем = Новый Соответствие;
    ТемыМассив = Данные.Получить("темы");

    // Первый проход — создание тем.
    Для Каждого ТемаДанные Из ТемыМассив Цикл
        КодТемы = ТемаДанные.Получить("код");
        ТемаСсылка = Справочники.Темы.НайтиПоКоду(КодТемы, Ложь, , Курс);
        Если ЗначениеЗаполнено(ТемаСсылка) Тогда
            ТемаОбъект = ТемаСсылка.ПолучитьОбъект();
        Иначе
            ТемаОбъект = Справочники.Темы.СоздатьЭлемент();
            ТемаОбъект.Код = КодТемы;
            ТемаОбъект.Владелец = Курс;
        КонецЕсли;
        ТемаОбъект.Наименование    = Усечь(ТемаДанные.Получить("наименование"), 100);
        ТемаОбъект.Описание        = СтрокаИлиПусто(ТемаДанные.Получить("описание"));
        ТемаОбъект.Сложность       = ЧислоИлиНоль(ТемаДанные.Получить("сложность"));
        ТемаОбъект.ПорядокИзучения = ЧислоИлиНоль(ТемаДанные.Получить("порядок"));
        ТемаОбъект.Записать();
        КартаТем.Вставить(КодТемы, ТемаОбъект.Ссылка);
        Результат.Темы = Результат.Темы + 1;
    КонецЦикла;

    // Второй проход — привязка пререквизитов (ссылки на ранее созданные темы).
    Для Каждого ТемаДанные Из ТемыМассив Цикл
        Пререквизиты = ТемаДанные.Получить("пререквизиты");
        Если Пререквизиты = Неопределено Или Пререквизиты.Количество() = 0 Тогда
            Продолжить;
        КонецЕсли;
        ТемаОбъект = КартаТем.Получить(ТемаДанные.Получить("код")).ПолучитьОбъект();
        ТемаОбъект.Пререквизиты.Очистить();
        Для Каждого КодПрек Из Пререквизиты Цикл
            ПрекСсылка = КартаТем.Получить(КодПрек);
            Если ЗначениеЗаполнено(ПрекСсылка) Тогда
                СтрокаПрек = ТемаОбъект.Пререквизиты.Добавить();
                СтрокаПрек.Тема = ПрекСсылка;
            КонецЕсли;
        КонецЦикла;
        ТемаОбъект.Записать();
    КонецЦикла;

    Возврат КартаТем;

КонецФункции

// Загружает банк тестовых заданий из шести файлов подкаталога question_bank.
//
Процедура ЗагрузитьБанкЗаданий(Знач Каталог, Знач КартаТем, Результат)

    Файлы = Новый Массив;
    Файлы.Добавить("metadata.json");
    Файлы.Добавить("query_language.json");
    Файлы.Добавить("builtin_language.json");
    Файлы.Добавить("forms_ui.json");
    Файлы.Добавить("extensions.json");
    Файлы.Добавить("exchange.json");

    Для Каждого ИмяФайла Из Файлы Цикл
        Данные = ПрочитатьJSONФайл(Каталог + "question_bank/" + ИмяФайла);
        Если Данные = Неопределено Тогда
            Продолжить;
        КонецЕсли;
        ТемаСсылка = КартаТем.Получить(Данные.Получить("код_темы"));
        Если Не ЗначениеЗаполнено(ТемаСсылка) Тогда
            Продолжить;
        КонецЕсли;
        Для Каждого ЗаданиеДанные Из Данные.Получить("задания") Цикл
            ЗагрузитьОдноЗадание(ЗаданиеДанные, ТемаСсылка, Результат);
        КонецЦикла;
    КонецЦикла;

КонецПроцедуры

// Создаёт или обновляет одно тестовое задание и его стартовые параметры IRT.
//
Процедура ЗагрузитьОдноЗадание(Знач Данные, Знач ТемаСсылка, Результат)

    КодЗадания = Данные.Получить("код");
    ЗаданиеСсылка = Справочники.ТестовыеЗадания.НайтиПоКоду(КодЗадания);
    Если ЗначениеЗаполнено(ЗаданиеСсылка) Тогда
        Объект = ЗаданиеСсылка.ПолучитьОбъект();
    Иначе
        Объект = Справочники.ТестовыеЗадания.СоздатьЭлемент();
        Объект.Код = КодЗадания;
    КонецЕсли;

    Объект.Наименование         = Усечь(Данные.Получить("наименование"), 150);
    Объект.Тема                 = ТемаСсылка;
    Объект.ТипЗадания           = Перечисления.ТипыТестовыхЗаданий[Данные.Получить("тип")];
    Объект.Формулировка         = СтрокаИлиПусто(Данные.Получить("формулировка"));
    Объект.КонтекстПредъявления = СтрокаИлиПусто(Данные.Получить("контекст"));
    Объект.ВерсияПараметров     = 0;
    Объект.ВидимыйСтатус        = Истина;

    Объект.ВариантыОтвета.Очистить();
    Варианты = Данные.Получить("варианты");
    Если Варианты <> Неопределено Тогда
        Для Каждого Вариант Из Варианты Цикл
            Строка = Объект.ВариантыОтвета.Добавить();
            Строка.Текст = СтрокаИлиПусто(Вариант.Получить("текст"));
            Строка.ЯвляетсяПравильным = (Вариант.Получить("правильный") = Истина);
        КонецЦикла;
    КонецЕсли;

    Объект.ЭталонныйОтвет.Очистить();
    Эталон = Данные.Получить("эталон");
    Если Эталон <> Неопределено Тогда
        Для Каждого ЭлементЭталона Из Эталон Цикл
            Строка = Объект.ЭталонныйОтвет.Добавить();
            Строка.Текст = СтрокаИлиПусто(ЭлементЭталона.Получить("текст"));
            Строка.Тип   = Усечь(ЭлементЭталона.Получить("тип"), 50);
        КонецЦикла;
    КонецЕсли;

    Объект.Записать();
    Результат.Задания = Результат.Задания + 1;

    ЗначениеA = Данные.Получить("a");
    Если ЗначениеA = Неопределено Тогда
        ЗначениеA = 1;
    КонецЕсли;
    ЗаписатьСтартовыеПараметры(Объект.Ссылка, ЧислоИлиНоль(Данные.Получить("b")), Число(ЗначениеA));

КонецПроцедуры

// Записывает стартовые параметры IRT (версия 0, статус «Не калибровано»).
//
Процедура ЗаписатьСтартовыеПараметры(Знач Задание, Знач ТрудностьB, Знач ДискриминативностьA)

    НаборЗаписей = РегистрыСведений.ПараметрыIRT.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.Задание.Установить(Задание);
    НаборЗаписей.Отбор.ВерсияПараметров.Установить(0);
    Запись = НаборЗаписей.Добавить();
    Запись.Задание              = Задание;
    Запись.ВерсияПараметров     = 0;
    Запись.ТрудностьB           = ТрудностьB;
    Запись.ДискриминативностьA  = ДискриминативностьA;
    Запись.СтатусКалибровки     = Перечисления.СтатусыКалибровкиЗадания.НеКалибровано;
    Запись.ДатаКалибровки       = ТекущаяДатаСеанса();
    Запись.ЧислоОтветовВВыборке = 0;
    НаборЗаписей.Записать(Истина);

КонецПроцедуры

// Загружает бейджи с условиями активации.
//
Процедура ЗагрузитьБейджи(Знач Каталог, Результат)

    Данные = ПрочитатьJSONФайл(Каталог + "badges_seed.json");
    Если Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Для Каждого БейджДанные Из Данные.Получить("бейджи") Цикл
        Код = БейджДанные.Получить("код");
        Ссылка = Справочники.Бейджи.НайтиПоКоду(Код);
        Если ЗначениеЗаполнено(Ссылка) Тогда
            Объект = Ссылка.ПолучитьОбъект();
        Иначе
            Объект = Справочники.Бейджи.СоздатьЭлемент();
            Объект.Код = Код;
        КонецЕсли;
        Объект.Наименование    = Усечь(БейджДанные.Получить("наименование"), 100);
        Объект.Категория       = Перечисления.КатегорииБейджей[БейджДанные.Получить("категория")];
        Объект.Описание        = СтрокаИлиПусто(БейджДанные.Получить("описание"));
        Объект.БаллыЗаПолучение = ЧислоИлиНоль(БейджДанные.Получить("баллы"));

        Объект.УсловияАктивации.Очистить();
        Условия = БейджДанные.Получить("условия");
        Если Условия <> Неопределено Тогда
            Для Каждого Условие Из Условия Цикл
                Строка = Объект.УсловияАктивации.Добавить();
                Строка.ТипУсловия        = СтрокаИлиПусто(Условие.Получить("тип"));
                Строка.Параметр          = СтрокаИлиПусто(Условие.Получить("параметр"));
                Строка.ПороговоеЗначение = ЧислоИлиНоль(Условие.Получить("порог"));
            КонецЦикла;
        КонецЕсли;
        Объект.Записать();
        Результат.Бейджи = Результат.Бейджи + 1;
    КонецЦикла;

КонецПроцедуры

// Загружает материалы библиотеки с привязками к темам.
//
Процедура ЗагрузитьБиблиотеку(Знач Каталог, Знач КартаТем, Результат)

    Данные = ПрочитатьJSONФайл(Каталог + "library_seed.json");
    Если Данные = Неопределено Тогда
        Возврат;
    КонецЕсли;

    Для Каждого МатериалДанные Из Данные.Получить("материалы") Цикл
        Код = МатериалДанные.Получить("код");
        Ссылка = Справочники.МатериалыБиблиотеки.НайтиПоКоду(Код);
        Если ЗначениеЗаполнено(Ссылка) Тогда
            Объект = Ссылка.ПолучитьОбъект();
        Иначе
            Объект = Справочники.МатериалыБиблиотеки.СоздатьЭлемент();
            Объект.Код = Код;
        КонецЕсли;
        Объект.Наименование              = Усечь(МатериалДанные.Получить("наименование"), 150);
        Объект.ВидМатериала              = Перечисления.ВидыМатериаловБиблиотеки[МатериалДанные.Получить("вид")];
        Объект.БиблиографическоеОписание = СтрокаИлиПусто(МатериалДанные.Получить("библиография"));
        Объект.КраткоеОписание           = СтрокаИлиПусто(МатериалДанные.Получить("краткое_описание"));
        Объект.КлючевыеСлова             = СтрокаИлиПусто(МатериалДанные.Получить("ключевые_слова"));
        Объект.Автор                     = СтрокаИлиПусто(МатериалДанные.Получить("автор"));
        Объект.ГодИздания                = ЧислоИлиНоль(МатериалДанные.Получить("год"));
        Объект.Издательство              = СтрокаИлиПусто(МатериалДанные.Получить("издательство"));
        Объект.ISBN                      = СтрокаИлиПусто(МатериалДанные.Получить("isbn"));

        ИмяФайлаОтн = СтрокаИлиПусто(МатериалДанные.Получить("файл"));
        Если ЗначениеЗаполнено(ИмяФайлаОтн) Тогда
            ЗагрузитьФайлКниги(Объект, Каталог + ИмяФайлаОтн);
        КонецЕсли;

        Объект.ПривязкиКТемам.Очистить();
        ТемыКоды = МатериалДанные.Получить("темы");
        Приоритет = 1;
        Если ТемыКоды <> Неопределено Тогда
            Для Каждого КодТемы Из ТемыКоды Цикл
                ТемаСсылка = КартаТем.Получить(КодТемы);
                Если ЗначениеЗаполнено(ТемаСсылка) Тогда
                    Строка = Объект.ПривязкиКТемам.Добавить();
                    Строка.Тема = ТемаСсылка;
                    Строка.Приоритет = Приоритет;
                    Приоритет = Приоритет + 1;
                КонецЕсли;
            КонецЦикла;
        КонецЕсли;
        Объект.Записать();
        Результат.Материалы = Результат.Материалы + 1;
    КонецЦикла;

КонецПроцедуры

// --- Вспомогательные функции ---

// Читает файл книги с диска и помещает его в реквизит ФайлКниги
// (ХранилищеЗначения). ИмяФайлаКниги - исходное имя файла. Дополнительно грузит
// предрендеренные PNG-страницы (для просмотра внутри программы).
//
Процедура ЗагрузитьФайлКниги(Объект, Знач Путь)

    Файл = Новый Файл(Путь);
    Если Не Файл.Существует() Тогда
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "ПервоначальноеНаполнение", "Файл книги не найден: " + Путь);
        Возврат;
    КонецЕсли;

    ДвоичныеДанные = Новый ДвоичныеДанные(Путь);
    Объект.ФайлКниги     = Новый ХранилищеЗначения(ДвоичныеДанные);
    Объект.ИмяФайлаКниги = Файл.Имя;

    ЗагрузитьСтраницыКниги(Объект, Файл);

КонецПроцедуры

// Грузит предрендеренные PNG-страницы книги в реквизит СтраницыКниги (массив
// ДвоичныхДанных в ХранилищеЗначения). Страницы лежат в папке рядом с PDF:
// <имя-pdf-без-расширения>/page-NNN.png (готовятся скриптом
// fixtures/books/render_pdf_pages.mjs). Если папки/страниц нет - реквизит пуст,
// просмотрщик покажет заглушку.
//
Процедура ЗагрузитьСтраницыКниги(Объект, Знач ФайлPDF)

    ПапкаСтраниц = ФайлPDF.Путь + ФайлPDF.ИмяБезРасширения;
    НайденныеФайлы = НайтиФайлы(ПапкаСтраниц, "page-*.png");

    Если НайденныеФайлы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    // НайтиФайлы не гарантирует порядок - сортируем по имени (page-001, page-002, ...).
    СписокИмен = Новый СписокЗначений;
    Для Каждого Ф Из НайденныеФайлы Цикл
        СписокИмен.Добавить(Ф.ПолноеИмя);
    КонецЦикла;
    СписокИмен.СортироватьПоЗначению();
    Имена = СписокИмен.ВыгрузитьЗначения();

    Страницы = Новый Массив;
    Для Каждого ПолноеИмя Из Имена Цикл
        Страницы.Добавить(Новый ДвоичныеДанные(ПолноеИмя));
    КонецЦикла;

    Объект.СтраницыКниги = Новый ХранилищеЗначения(Страницы);

КонецПроцедуры

Функция ПрочитатьJSONФайл(Знач Путь)

    Файл = Новый Файл(Путь);
    Если Не Файл.Существует() Тогда
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой(
            "ПервоначальноеНаполнение", "Файл эталонных данных не найден: " + Путь);
        Возврат Неопределено;
    КонецЕсли;

    Чтение = Новый ЧтениеТекста(Путь, КодировкаТекста.UTF8);
    Текст = Чтение.Прочитать();
    Чтение.Закрыть();

    Возврат ОбщегоНазначенияСерверПриложение.ДесериализоватьИзJSON(Текст);

КонецФункции

Функция НормализоватьКаталог(Знач Каталог)

    Если Не ЗначениеЗаполнено(Каталог) Тогда
        ВызватьИсключение "Не указан каталог с файлами эталонных данных (fixtures).";
    КонецЕсли;
    Стр = СтрЗаменить(Каталог, "\", "/");
    Если Прав(Стр, 1) <> "/" Тогда
        Стр = Стр + "/";
    КонецЕсли;
    Возврат Стр;

КонецФункции

Функция ДатаИзСтроки(Знач Значение)

    Если Не ЗначениеЗаполнено(Значение) Тогда
        Возврат '00010101';
    КонецЕсли;
    Части = СтрРазделить(Строка(Значение), "-");
    Если Части.Количество() < 3 Тогда
        Возврат '00010101';
    КонецЕсли;
    Возврат Дата(Число(Части[0]), Число(Части[1]), Число(Части[2]));

КонецФункции

Функция ЧислоИлиНоль(Знач Значение)

    Если Значение = Неопределено Тогда
        Возврат 0;
    КонецЕсли;
    Возврат Число(Значение);

КонецФункции

Функция СтрокаИлиПусто(Знач Значение)

    Если Значение = Неопределено Тогда
        Возврат "";
    КонецЕсли;
    Возврат Строка(Значение);

КонецФункции

Функция Усечь(Знач Значение, Знач МаксимальнаяДлина)

    Стр = СтрокаИлиПусто(Значение);
    Если СтрДлина(Стр) > МаксимальнаяДлина Тогда
        Стр = Лев(Стр, МаксимальнаяДлина);
    КонецЕсли;
    Возврат Стр;

КонецФункции

#КонецОбласти

#Область ДемоНаполнение

// Наполняет базу демонстрационными данными для защиты ВКР: устанавливает константы,
// создает преподавателя, учебную группу, 24 обучающихся и их учебную историю за 4 недели
// (попытки тестов, оценки theta, баллы опыта, события аналитики, бейджи, рейтинг), а также
// создает учетные записи входа с ролями. Идемпотентно: при наличии демо-группы повторно
// данные не создаются.
//
// Параметры:
//  КаталогФикстур - Строка - путь к каталогу fixtures (см. ВыполнитьНаполнение).
//
// Возвращаемое значение:
//  Структура - результат ВыполнитьНаполнение, дополненный ключами:
//   * Студенты - Число  - количество созданных обучающихся.
//   * Сессии   - Число  - количество созданных попыток тестирования.
//   * Логины   - Строка - перечень созданных учетных записей входа.
//
Функция ВыполнитьДемоНаполнение(Знач КаталогФикстур = "") Экспорт

    Результат = ВыполнитьНаполнение(КаталогФикстур);
    Результат.Вставить("Студенты", 0);
    Результат.Вставить("Сессии",   0);
    Результат.Вставить("Логины",   "");
    Если Не ПустаяСтрока(Результат.Ошибка) Тогда
        Возврат Результат;
    КонецЕсли;

    Попытка
        УстановитьПривилегированныйРежим(Истина);
        СоздатьДемоДанные(Результат);
    Исключение
        Результат.Ошибка = ОписаниеОшибки();
        ОбщегоНазначенияСерверПриложение.ЗафиксироватьСбой("ДемоНаполнение", Результат.Ошибка);
    КонецПопытки;

    Возврат Результат;

КонецФункции

Процедура СоздатьДемоДанные(Результат)

    УстановитьКонстантыПоУмолчанию();

    Если ДемоГруппаСуществует() Тогда
        Результат.Вставить("Сообщение", "Демо-данные уже созданы ранее");
        Возврат;
    КонецЕсли;

    Курс = ПервыйКурс();
    Если Не ЗначениеЗаполнено(Курс) Тогда
        ВызватьИсключение "Нет курса для демо-наполнения (сначала загрузите фикстуры)";
    КонецЕсли;

    Темы = ТемыКурсаСЗаданиями(Курс);
    Если Темы.Количество() = 0 Тогда
        ВызватьИсключение "Нет тем для демо-наполнения";
    КонецЕсли;

    Сегодня   = НачалоДня(ТекущаяДатаСеанса());
    ДатаСтарт = Сегодня - 28 * 86400;
    ГСЧ       = Новый ГенераторСлучайныхЧисел(20260621);
    ПорогТета = ОбщегоНазначенияСерверПриложение.ЗначениеКонстанты("ПорогТетаДляПрохожденияТемы");

    Преподаватель = СоздатьПользователяДемо("Иванова Мария Петровна", Перечисления.ВидыПользователей.Преподаватель);

    ИменаСтудентов = СписокИменСтудентов();
    Студенты = Новый Массив;
    Группа = Справочники.УчебныеГруппы.СоздатьЭлемент();
    Группа.Наименование  = ДемоГруппаНаименование();
    Группа.Преподаватель = Преподаватель;
    Группа.ГодНабора     = 2025;
    Для Сч = 0 По 23 Цикл
        Студент = СоздатьПользователяДемо(ИменаСтудентов[Сч], Перечисления.ВидыПользователей.Обучающийся);
        Студенты.Добавить(Студент);
        СтрокаСостава = Группа.Состав.Добавить();
        СтрокаСостава.Пользователь    = Студент;
        СтрокаСостава.ДатаЗачисления = ДатаСтарт;
    КонецЦикла;
    Группа.Записать();
    ГруппаСсылка = Группа.Ссылка;

    Для Индекс = 0 По Студенты.Количество() - 1 Цикл
        СоздатьИсториюСтудента(Студенты[Индекс], Индекс, Темы, ДатаСтарт, Сегодня, ГСЧ, ПорогТета, Результат);
    КонецЦикла;

    // Бейджи и траектория - по фактически накопленным метрикам.
    Для Каждого Студент Из Студенты Цикл
        Геймификация.ПроверитьУсловияБейджей(Студент);
        ТраекторияОбучения.ПересобратьТраекторию(Студент, Курс);
    КонецЦикла;

    // Два среза рейтинга (неделю назад и сегодня) - чтобы показать изменение позиции.
    НаписатьРейтингНаДату(ГруппаСсылка, Сегодня - 7 * 86400);
    Геймификация.ОбновитьРейтинг(ГруппаСсылка);

    // Практические задания и автоматически проверенные решения.
    СоздатьПрактическиеЗаданияИПроверки(Студенты, Темы, Сегодня);

    // Учетные записи входа с ролями. Администратора создаем первым: платформа не дает
    // создать первого пользователя ИБ без административных прав.
    // Пароль у каждой учетной записи совпадает с логином (для удобства демонстрации).
    Логины = "";
    Логины = Логины + СоздатьАдминвходДемо() + "; ";
    Логины = Логины + СоздатьВходДемо(Преподаватель, "teacher", "teacher", "Преподаватель") + "; ";
    Логины = Логины + СоздатьВходДемо(Студенты[0], "student", "student", "Обучающийся") + "; ";
    Логины = Логины + СоздатьВходДемо(Студенты[1], "student2", "student2", "Обучающийся");

    Результат.Студенты = Студенты.Количество();
    Результат.Логины   = Логины;

КонецПроцедуры

Процедура УстановитьКонстантыПоУмолчанию()

    УстановитьКонстантуЕслиПусто("URLМикросервисаIRT",         "http://localhost:8001");
    УстановитьКонстантуЕслиПусто("ТаймаутЗапросаКМикросервису", 30);
    УстановитьКонстантуЕслиПусто("ЛимитЗаданийВСессии",         25);
    УстановитьКонстантуЕслиПусто("ЦелеваяСтандартнаяОшибкаТета", 0.30);
    УстановитьКонстантуЕслиПусто("ПорогТетаДляПрохожденияТемы",  0.5);
    УстановитьКонстантуЕслиПусто("ПорогОтветовДляКалибровки",    30);

КонецПроцедуры

Процедура УстановитьКонстантуЕслиПусто(Знач Имя, Знач Значение)

    КонстантаМенеджер = Константы[Имя];
    Если Не ЗначениеЗаполнено(КонстантаМенеджер.Получить()) Тогда
        КонстантаМенеджер.Установить(Значение);
    КонецЕсли;

КонецПроцедуры

Процедура СоздатьИсториюСтудента(Знач Студент, Знач Индекс, Знач Темы, Знач ДатаСтарт,
                                  Знач Сегодня, ГСЧ, Знач ПорогТета, Результат)

    Показательный = (Индекс = 0);
    Способность   = СпособностьСтудента(Индекс, ГСЧ);

    Для Каждого ТемаДанные Из Темы Цикл
        ТемаСсылка = ТемаДанные.Ссылка;
        Задания    = ТемаДанные.Задания;

        ТетаПре = Способность + СлучайноеНормальное(ГСЧ, -0.2, 0.45);
        Прирост = Макс(0.15, Мин(1.6, СлучайноеНормальное(ГСЧ, 0.84, 0.30)));
        ТетаПост = ТетаПре + Прирост;
        Если Показательный Тогда
            ТетаПост = Макс(ТетаПост, 1.3);
        КонецЕсли;
        SEПост = Окр(0.26 + СлучайноеРавномерное(ГСЧ, 0, 0.06), 2);

        ДеньСессии = 14 + Цел(СлучайноеРавномерное(ГСЧ, 0, 13));
        ДатаСессии = ДатаСтарт + ДеньСессии * 86400 + (9 + Индекс % 8) * 3600;

        НаписатьОценку(Студент, ТемаСсылка, ТетаПре,                  0.6, ДатаСтарт + 86400, Неопределено);
        НаписатьОценку(Студент, ТемаСсылка, (ТетаПре + ТетаПост) / 2, 0.4, ДатаСтарт + 14 * 86400, Неопределено);

        Сессия = НаписатьСессию(Студент, ТемаСсылка, ТетаПост, SEПост, ДатаСессии, ГСЧ, Задания);
        НаписатьОценку(Студент, ТемаСсылка, ТетаПост, SEПост, ДатаСессии + 700, Сессия.Ссылка);
        Результат.Сессии = Результат.Сессии + 1;

        НаписатьСобытие(Студент, ТемаСсылка, Перечисления.ТипыСобытийАналитики.ОткрытиеМатериала,   ДатаСессии - 3600);
        НаписатьСобытие(Студент, ТемаСсылка, Перечисления.ТипыСобытийАналитики.НачалоСессииТеста,    ДатаСессии);
        НаписатьСобытие(Студент, ТемаСсылка, Перечисления.ТипыСобытийАналитики.ЗавершениеСессии,     ДатаСессии + 700);

        Если Сессия.Верных > 0 Тогда
            НаписатьНачисление(Студент, ТемаСсылка, Перечисления.ПричиныНачисленияБаллов.ВерныйОтвет,
                Сессия.Верных * 5, ДатаСессии + 720);
        КонецЕсли;
        Если ТетаПост >= ПорогТета Тогда
            НаписатьНачисление(Студент, ТемаСсылка, Перечисления.ПричиныНачисленияБаллов.ЗавершениеТемы,
                20, ДатаСессии + 740);
        КонецЕсли;
    КонецЦикла;

КонецПроцедуры

Функция НаписатьСессию(Знач Студент, Знач Тема, Знач ТетаИтог, Знач SEИтог, Знач Дата, ГСЧ, Знач Задания)

    Сессия = Документы.ПопыткаТеста.СоздатьДокумент();
    Сессия.Дата         = Дата;
    Сессия.Обучающийся  = Студент;
    Сессия.Тема         = Тема;
    Сессия.ДатаНачала   = Дата;

    Колода = СкопироватьМассив(Задания);
    ПеремешатьМассив(Колода, ГСЧ);
    Число = 10 + Цел(СлучайноеРавномерное(ГСЧ, 0, 4));
    Если Число > Колода.Количество() Тогда
        Число = Колода.Количество();
    КонецЕсли;

    Верных       = 0;
    ТекущееВремя = Дата;
    Для Шаг = 1 По Число Цикл
        ЗаданиеДанные = Колода[Шаг - 1];
        B = ЗаданиеДанные.B;
        P = 1 / (1 + Exp(-(ТетаИтог - B)));
        Верно = (СлучайноеРавномерное(ГСЧ, 0, 1) < P);
        Если Верно Тогда
            Верных = Верных + 1;
        КонецЕсли;
        ВремяОтвета  = 25 + Цел(СлучайноеРавномерное(ГСЧ, 0, 90));
        ТекущееВремя = ТекущееВремя + ВремяОтвета;

        Стр = Сессия.Ответы.Добавить();
        Стр.НомерШага         = Шаг;
        Стр.Задание           = ЗаданиеДанные.Ссылка;
        Стр.Верно             = Верно;
        Стр.Время             = ВремяОтвета;
        Стр.ТекущаяОценкаТета = Окр(ТетаИтог * (1 - Exp(-Шаг / 3.0)), 2);
        Стр.ТекущаяSE         = Окр(Макс(SEИтог, 1.0 / Sqrt(Шаг)), 2);
    КонецЦикла;

    Сессия.ДатаОкончания     = ТекущееВремя;
    Сессия.ИтоговаяОценкаТета = Окр(ТетаИтог, 2);
    Сессия.ИтоговаяSE         = SEИтог;
    Сессия.ЧислоЗаданий       = Число;
    Сессия.СтатусСессии       = "Завершена";
    Сессия.Записать(РежимЗаписиДокумента.Проведение);

    Возврат Новый Структура("Ссылка, Верных, Всего", Сессия.Ссылка, Верных, Число);

КонецФункции

Процедура НаписатьОценку(Знач Студент, Знач Тема, Знач Тета, Знач SE, Знач Дата, Знач Источник)

    Менеджер = РегистрыСведений.ОценкиПодготовленностиПоТемам.СоздатьМенеджерЗаписи();
    Менеджер.Период      = Дата;
    Менеджер.Пользователь = Студент;
    Менеджер.Тема        = Тема;
    Менеджер.Тета        = Окр(Тета, 2);
    Менеджер.SE          = Окр(SE, 2);
    Если Источник <> Неопределено Тогда
        Менеджер.Источник = Источник;
    КонецЕсли;
    Менеджер.Записать(Истина);

КонецПроцедуры

Процедура НаписатьСобытие(Знач Студент, Знач Тема, Знач ТипСобытия, Знач Дата)

    Набор = РегистрыСведений.СобытияАналитики.СоздатьНаборЗаписей();
    Запись = Набор.Добавить();
    Запись.Период          = Дата;
    Запись.Пользователь    = Студент;
    Запись.Тема            = Тема;
    Запись.ТипСобытия      = ТипСобытия;
    Запись.КлючСобытия     = Строка(Новый УникальныйИдентификатор());
    Запись.ПолезнаяНагрузка = "{}";
    Набор.Записать(Ложь);

КонецПроцедуры

Процедура НаписатьНачисление(Знач Студент, Знач Тема, Знач Причина, Знач Количество, Знач Дата)

    Документ = Документы.НачислениеБаллов.СоздатьДокумент();
    Документ.Дата        = Дата;
    Документ.Обучающийся = Студент;
    Документ.Тема        = Тема;
    Документ.Причина     = Причина;
    Документ.Количество  = Количество;
    Документ.Записать(РежимЗаписиДокумента.Проведение);

КонецПроцедуры

Процедура НаписатьРейтингНаДату(Знач Группа, Знач Дата)

    Период = НачалоДня(Дата);
    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Состав.Пользователь                  КАК Пользователь,
        |   ЕСТЬNULL(Баллы.КоличествоОборот, 0)  КАК Сумма
        |ИЗ
        |   Справочник.УчебныеГруппы.Состав КАК Состав
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БаллыОпыта.Обороты(, &Конец, , ) КАК Баллы
        |       ПО Баллы.Пользователь = Состав.Пользователь
        |ГДЕ Состав.Ссылка = &Группа
        |УПОРЯДОЧИТЬ ПО Сумма УБЫВ");
    Запрос.УстановитьПараметр("Группа", Группа);
    Запрос.УстановитьПараметр("Конец",  КонецДня(Дата));
    Выборка = Запрос.Выполнить().Выбрать();

    Набор = РегистрыСведений.РейтинговыеПозиции.СоздатьНаборЗаписей();
    Набор.Отбор.УчебнаяГруппа.Установить(Группа);
    Набор.Отбор.Период.Установить(Период);
    Ранг = 0;
    Пока Выборка.Следующий() Цикл
        Ранг = Ранг + 1;
        Запись = Набор.Добавить();
        Запись.Период        = Период;
        Запись.УчебнаяГруппа = Группа;
        Запись.Пользователь  = Выборка.Пользователь;
        Запись.СуммаБаллов   = Выборка.Сумма;
        Запись.Ранг          = Ранг;
        Запись.СредняяТета   = 0;
    КонецЦикла;
    Набор.Записать(Истина);

КонецПроцедуры

Функция СоздатьПользователяДемо(Знач ФИО, Знач Вид)

    Объект = Справочники.Пользователи.СоздатьЭлемент();
    Объект.Наименование = Лев(СокрЛП(ФИО), 150);
    Объект.Вид          = Вид;
    Объект.ОбменДанными.Загрузка = Истина; // не создавать пользователя ИБ на этом шаге
    Объект.Записать();
    Возврат Объект.Ссылка;

КонецФункции

Функция СоздатьВходДемо(Знач ПользовательСсылка, Знач Логин, Знач Пароль, Знач ИмяРоли)

    ПользовательИБ = Неопределено;
    Для Каждого СуществующийИБ Из ПользователиИнформационнойБазы.ПолучитьПользователей() Цикл
        Если СуществующийИБ.Имя = Логин Тогда
            ПользовательИБ = СуществующийИБ;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    Если ПользовательИБ = Неопределено Тогда
        ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    КонецЕсли;
    ПользовательИБ.Имя                     = Логин;
    ПользовательИБ.ПолноеИмя               = Строка(ПользовательСсылка);
    ПользовательИБ.АутентификацияСтандартная = Истина;
    ПользовательИБ.ПоказыватьВСпискеВыбора  = Истина;
    ПользовательИБ.Пароль                   = Пароль;
    ПользовательИБ.Роли.Очистить();
    РольМетаданных = Метаданные.Роли.Найти(ИмяРоли);
    Если РольМетаданных <> Неопределено Тогда
        ПользовательИБ.Роли.Добавить(РольМетаданных);
    КонецЕсли;
    ПользовательИБ.Записать();

    Объект = ПользовательСсылка.ПолучитьОбъект();
    Объект.ИмяПользователяИБ           = Логин;
    Объект.ИдентификаторПользователяИБ = Строка(ПользователиИБИдентификатор(ПользовательИБ));
    Объект.ОбменДанными.Загрузка       = Истина;
    Объект.Записать();

    Возврат Логин + " (" + ИмяРоли + ")";

КонецФункции

Функция ПользователиИБИдентификатор(Знач ПользовательИБ)

    Возврат ПользовательИБ.УникальныйИдентификатор;

КонецФункции

Функция СоздатьАдминвходДемо()

    Админ = СоздатьПользователяДемо("Администратор учебного процесса", Перечисления.ВидыПользователей.Администратор);
    Возврат СоздатьВходДемо(Админ, "admin", "admin", "АдминистраторУчебногоПроцесса");

КонецФункции

Функция ДемоГруппаНаименование()

    Возврат "ИВТ-2025 (демонстрационная группа)";

КонецФункции

Функция ДемоГруппаСуществует()

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1 Группы.Ссылка
        |ИЗ Справочник.УчебныеГруппы КАК Группы
        |ГДЕ Группы.Наименование = &Наименование");
    Запрос.УстановитьПараметр("Наименование", ДемоГруппаНаименование());
    Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

Функция ПервыйКурс()

    Запрос = Новый Запрос(
        "ВЫБРАТЬ ПЕРВЫЕ 1 Курсы.Ссылка КАК Ссылка
        |ИЗ Справочник.Курсы КАК Курсы
        |ГДЕ НЕ Курсы.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО Курсы.Наименование");
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    КонецЕсли;
    Возврат Справочники.Курсы.ПустаяСсылка();

КонецФункции

Функция ТемыКурсаСЗаданиями(Знач Курс)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Темы.Ссылка КАК Тема
        |ИЗ Справочник.Темы КАК Темы
        |ГДЕ Темы.Владелец = &Курс И НЕ Темы.ПометкаУдаления
        |УПОРЯДОЧИТЬ ПО Темы.ПорядокИзучения");
    Запрос.УстановитьПараметр("Курс", Курс);
    ВыборкаТем = Запрос.Выполнить().Выбрать();

    Результат = Новый Массив;
    Пока ВыборкаТем.Следующий() Цикл
        Задания = ЗаданияТемыСТрудностью(ВыборкаТем.Тема);
        Если Задания.Количество() = 0 Тогда
            Продолжить;
        КонецЕсли;
        Результат.Добавить(Новый Структура("Ссылка, Задания", ВыборкаТем.Тема, Задания));
    КонецЦикла;
    Возврат Результат;

КонецФункции

Функция ЗаданияТемыСТрудностью(Знач Тема)

    Запрос = Новый Запрос(
        "ВЫБРАТЬ
        |   Задания.Ссылка                    КАК Ссылка,
        |   ЕСТЬNULL(Параметры.ТрудностьB, 0) КАК B
        |ИЗ
        |   Справочник.ТестовыеЗадания КАК Задания
        |   ЛЕВОЕ СОЕДИНЕНИЕ (
        |       ВЫБРАТЬ Задание КАК Задание, МАКСИМУМ(ВерсияПараметров) КАК Версия
        |       ИЗ РегистрСведений.ПараметрыIRT
        |       СГРУППИРОВАТЬ ПО Задание) КАК МаксВерсия
        |       ПО МаксВерсия.Задание = Задания.Ссылка
        |   ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПараметрыIRT КАК Параметры
        |       ПО Параметры.Задание = Задания.Ссылка
        |       И Параметры.ВерсияПараметров = МаксВерсия.Версия
        |ГДЕ Задания.Тема = &Тема И НЕ Задания.ПометкаУдаления");
    Запрос.УстановитьПараметр("Тема", Тема);
    Выборка = Запрос.Выполнить().Выбрать();

    Результат = Новый Массив;
    Пока Выборка.Следующий() Цикл
        Результат.Добавить(Новый Структура("Ссылка, B", Выборка.Ссылка, Выборка.B));
    КонецЦикла;
    Возврат Результат;

КонецФункции

Функция СпособностьСтудента(Знач Индекс, ГСЧ)

    // Базовая подготовленность: равномерный разброс от -1.0 до +1.3 по индексу
    // плюс небольшой шум - чтобы рейтинг и тепловая карта были разнообразными.
    База = -1.0 + Индекс * (2.3 / 23.0);
    Возврат База + СлучайноеНормальное(ГСЧ, 0, 0.2);

КонецФункции

Функция СлучайноеРавномерное(ГСЧ, Знач Мин, Знач Макс)

    Доля = ГСЧ.СлучайноеЧисло(0, 1000000000) / 1000000000;
    Возврат Мин + (Макс - Мин) * Доля;

КонецФункции

Функция СлучайноеНормальное(ГСЧ, Знач Среднее, Знач Сигма)

    У1 = Макс(0.0000001, СлучайноеРавномерное(ГСЧ, 0, 1));
    У2 = СлучайноеРавномерное(ГСЧ, 0, 1);
    Z  = Sqrt(-2 * Log(У1)) * Cos(2 * 3.141592653589793 * У2);
    Возврат Среднее + Сигма * Z;

КонецФункции

Функция СкопироватьМассив(Знач Исходный)

    Копия = Новый Массив;
    Для Каждого Элемент Из Исходный Цикл
        Копия.Добавить(Элемент);
    КонецЦикла;
    Возврат Копия;

КонецФункции

Процедура ПеремешатьМассив(Массив, ГСЧ)

    Всего = Массив.Количество();
    Если Всего < 2 Тогда
        Возврат;
    КонецЕсли;
    Для Индекс = 0 По Всего - 2 Цикл
        Диапазон = Всего - Индекс;
        Смещение = Цел(СлучайноеРавномерное(ГСЧ, 0, Диапазон));
        Если Смещение >= Диапазон Тогда
            Смещение = Диапазон - 1;
        КонецЕсли;
        ИндексJ        = Индекс + Смещение;
        Временное      = Массив[Индекс];
        Массив[Индекс] = Массив[ИндексJ];
        Массив[ИндексJ] = Временное;
    КонецЦикла;

КонецПроцедуры

Процедура СоздатьПрактическиеЗаданияИПроверки(Знач Студенты, Знач Темы, Знач Сегодня)

    Если Темы.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;
    ТемаЗадания = Темы[0].Ссылка;

    ЧеклистСправочник = "{""ОбязательныеПроцедуры"":[""ПередЗаписью""],"
        + """ОбязательныеКонструкции"":[""ИНН"",""Справочник""],"
        + """ЗапрещенныеКонструкции"":[""Сообщить(""]}";
    Задание1 = СоздатьПрактЗадание(ТемаЗадания,
        "Создать справочник Контрагенты с реквизитом ИНН и обработчиком ПередЗаписью",
        ЧеклистСправочник);

    ЧеклистЗапрос = "{""ОбязательныеКонструкции"":[""ВЫБРАТЬ"",""ИЗ"",""ГДЕ""],""ЗапрещенныеКонструкции"":[]}";
    Задание2 = СоздатьПрактЗадание(ТемаЗадания,
        "Написать запрос выборки номенклатуры по артикулу",
        ЧеклистЗапрос);

    КодХороший =
        "// Обработчик справочника Контрагенты" + Символы.ПС
        + "Процедура ПередЗаписью(Отказ) Экспорт" + Символы.ПС
        + "    Если ПустаяСтрока(ИНН) Тогда" + Символы.ПС
        + "        Отказ = Истина;" + Символы.ПС
        + "    КонецЕсли;" + Символы.ПС
        + "КонецПроцедуры";

    КодСОшибкой =
        "Функция ПроверитьИНН()" + Символы.ПС
        + "    Сообщить(""проверка"");" + Символы.ПС
        + "    Если Истина Тогда" + Символы.ПС
        + "        Возврат Ложь;" + Символы.ПС
        + "КонецФункции";

    КодЗапрос =
        "ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ Артикул = &Артикул";

    Выполнение1 = СоздатьВыполнение(Студенты[0], Задание1, КодХороший, Сегодня - 2 * 86400);
    ПроверкаПрактическихЗаданий.ПроверитьВыполнение(Выполнение1);

    Выполнение2 = СоздатьВыполнение(Студенты[3], Задание1, КодСОшибкой, Сегодня - 86400);
    ПроверкаПрактическихЗаданий.ПроверитьВыполнение(Выполнение2);

    Выполнение3 = СоздатьВыполнение(Студенты[1], Задание2, КодЗапрос, Сегодня - 86400);
    ПроверкаПрактическихЗаданий.ПроверитьВыполнение(Выполнение3);

КонецПроцедуры

Функция СоздатьПрактЗадание(Знач Тема, Знач Формулировка, Знач ЧеклистJSON)

    Объект = Справочники.ПрактическиеЗадания.СоздатьЭлемент();
    Объект.Наименование      = Лев(Формулировка, 100);
    Объект.Тема              = Тема;
    Объект.ТипПроверки       = "Автоматическая";
    Объект.Формулировка      = Формулировка;
    Объект.ВремяНаВыполнение = 1800;
    Объект.ЭталонныйАртефакт = Новый ХранилищеЗначения(ЧеклистJSON);
    Объект.Записать();
    Возврат Объект.Ссылка;

КонецФункции

Функция СоздатьВыполнение(Знач Студент, Знач Задание, Знач Код, Знач Дата)

    Документ = Документы.ВыполнениеПрактическогоЗадания.СоздатьДокумент();
    Документ.Дата                 = Дата;
    Документ.Обучающийся          = Студент;
    Документ.Задание              = Задание;
    Документ.ДатаНачала           = Дата;
    Документ.ПрисоединённоеРешение = Новый ХранилищеЗначения(Код);
    Документ.Записать(РежимЗаписиДокумента.Запись);
    Возврат Документ.Ссылка;

КонецФункции

Функция СписокИменСтудентов()

    Имена = Новый Массив;
    Имена.Добавить("Смирнов Алексей Игоревич");
    Имена.Добавить("Кузнецова Анна Дмитриевна");
    Имена.Добавить("Попов Михаил Сергеевич");
    Имена.Добавить("Соколова Екатерина Андреевна");
    Имена.Добавить("Лебедев Дмитрий Александрович");
    Имена.Добавить("Новикова Ольга Викторовна");
    Имена.Добавить("Морозов Иван Павлович");
    Имена.Добавить("Петрова Юлия Олеговна");
    Имена.Добавить("Волков Артём Денисович");
    Имена.Добавить("Зайцева Мария Романовна");
    Имена.Добавить("Соловьёв Никита Андреевич");
    Имена.Добавить("Васильева Дарья Максимовна");
    Имена.Добавить("Михайлов Егор Витальевич");
    Имена.Добавить("Фёдорова Полина Сергеевна");
    Имена.Добавить("Алексеев Роман Олегович");
    Имена.Добавить("Степанова Виктория Игоревна");
    Имена.Добавить("Николаев Павел Андреевич");
    Имена.Добавить("Орлова Алиса Дмитриевна");
    Имена.Добавить("Макаров Кирилл Сергеевич");
    Имена.Добавить("Андреева Софья Александровна");
    Имена.Добавить("Захаров Тимофей Максимович");
    Имена.Добавить("Григорьева Вероника Павловна");
    Имена.Добавить("Сергеев Владислав Игоревич");
    Имена.Добавить("Тихонова Ксения Олеговна");
    Возврат Имена;

КонецФункции

#КонецОбласти

#КонецЕсли
